<template lang="pug">
.modal-data-wrapper
  .modal-data-header
    .modal-data-header__title На доработку
  .modal-data-content
    .modal-data-row
      .modal-data-table
    .modal-data-subtitle Комментарий
    .modal-data-row
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
      .modal-data-comment Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам. Методика проведения занятий математического кружка для обучающихся в 5 классе по подготовке к олимпиадам
  .modal-data-footer
    .modal-data-footer__btns
      a.btn.btn--second(@click="closeModal") Отмена
      a.btn(@click="closeModal") ОК
</template>

<script>
import { mapActions, mapState } from "vuex";

export default {
  name: "AuthInfo",
  components: {},

  computed: {
    ...mapState("modals", ["modalBodyClass"])
  },
  data() {
    return {};
  },
  async mounted() {},
  methods: {
    ...mapActions("modals", ["toggleModal"]),
    closeModal() {
      document.body.classList.remove("lock");
      document.body.classList.remove(this.modalBodyClass);
      this.isShowAnimate = false;
      setTimeout(() => this.toggleModal(false), 200);
    }
  }
};
</script>

<style scoped></style>
